---
kind: method
id: M:Autodesk.Revit.DB.SaveOptions.Dispose
source: html/24961293-2ae1-bfe8-ec1f-16f85331a5f3.htm
---
# Autodesk.Revit.DB.SaveOptions.Dispose Method

Releases all resources used by the SaveOptions

## Syntax (C#)
```csharp
public void Dispose()
```